bekencorp/bk_idk/middleware/soc/bk7286/soc/sys_struct.h
// reg0xd
typedef volatile union {
	struct {
		uint32_t h264_cken                        :  1; /**<bit[0 : 0] */
		uint32_t i2s1_cken                        :  1; /**<bit[1 : 1] */
		uint32_t i2s2_cken                        :  1; /**<bit[2 : 2] */
		uint32_t yuv_cken                         :  1; /**<bit[3 : 3] */
		uint32_t slcd_cken                        :  1; /**<bit[4 : 4] */
		uint32_t lin_cken                         :  1; /**<bit[5 : 5] */
		uint32_t src_cken                         :  1; /**<bit[6 : 6] */
		uint32_t enet_cken                        :  1; /**<bit[7 : 7] */
		uint32_t reserved_bit_8                   :  1; /**<bit[8 : 8] */
		uint32_t cis_auxs_cken                    :  1; /**<bit[9 : 9] */
		uint32_t reserved_10_31                   : 22; /**<bit[10 : 31] */
	};
	uint32_t v;
} sys_reserver_reg0xd_t;


typedef volatile union {
	struct {
		uint32_t uart1_mem_sd                     :  1; /**<bit[0 : 0] */
		uint32_t uart2                            :  1; /**<bit[1 : 1] */
		uint32_t spi1                             :  1; /**<bit[2 : 2] */
		uint32_t sdio                             :  1; /**<bit[3 : 3] */
		uint32_t usb                              :  1; /**<bit[4 : 4] */
		uint32_t can                              :  1; /**<bit[5 : 5] */
		uint32_t qspi0                            :  1; /**<bit[6 : 6] */
		uint32_t qspi1                            :  1; /**<bit[7 : 7] */
		uint32_t pram                             :  1; /**<bit[8 : 8] */
		uint32_t fft                              :  1; /**<bit[9 : 9] */
		uint32_t abc                              :  1; /**<bit[10 : 10] */
		uint32_t aud                              :  1; /**<bit[11 : 11] */
		uint32_t i2s0                             :  1; /**<bit[12 : 12] */
		uint32_t i2s1                             :  1; /**<bit[13 : 13] */
		uint32_t i2s2                             :  1; /**<bit[14 : 14] */
		uint32_t jpge                             :  1; /**<bit[15 : 15] */
		uint32_t yuv                              :  1; /**<bit[16 : 16] */
		uint32_t jpgd                             :  1; /**<bit[17 : 17] */
		uint32_t disp                             :  1; /**<bit[18 : 18] */
		uint32_t dmad                             :  1; /**<bit[19 : 19] */
		uint32_t h26f                             :  1; /**<bit[20 : 20] */
		uint32_t mac                              :  1; /**<bit[21 : 21] */
		uint32_t phy                              :  1; /**<bit[22 : 22] */
		uint32_t xvr                              :  1; /**<bit[23 : 23] */
		uint32_t irda                             :  1; /**<bit[24 : 24] */
		uint32_t la                               :  1; /**<bit[25 : 25] */
		uint32_t flsh                             :  1; /**<bit[26 : 26] */
		uint32_t uart                             :  1; /**<bit[27 : 27] */
		uint32_t spi0                             :  1; /**<bit[28 : 28] */
		uint32_t enc                              :  1; /**<bit[29 : 29] */
		uint32_t dma0                             :  1; /**<bit[30 : 30] */
		uint32_t dma1                             :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_device_mem_ctrl1_t;


typedef volatile union {
	struct {
		uint32_t uart1_mem_ds                     :  1; /**<bit[0 : 0] */
		uint32_t uart2                            :  1; /**<bit[1 : 1] */
		uint32_t spi1                             :  1; /**<bit[2 : 2] */
		uint32_t sdio                             :  1; /**<bit[3 : 3] */
		uint32_t usb                              :  1; /**<bit[4 : 4] */
		uint32_t can                              :  1; /**<bit[5 : 5] */
		uint32_t qspi0                            :  1; /**<bit[6 : 6] */
		uint32_t qspi1                            :  1; /**<bit[7 : 7] */
		uint32_t pram                             :  1; /**<bit[8 : 8] */
		uint32_t fft                              :  1; /**<bit[9 : 9] */
		uint32_t abc                              :  1; /**<bit[10 : 10] */
		uint32_t aud                              :  1; /**<bit[11 : 11] */
		uint32_t i2s0                             :  1; /**<bit[12 : 12] */
		uint32_t i2s1                             :  1; /**<bit[13 : 13] */
		uint32_t i2s2                             :  1; /**<bit[14 : 14] */
		uint32_t jpge                             :  1; /**<bit[15 : 15] */
		uint32_t yuv                              :  1; /**<bit[16 : 16] */
		uint32_t jpgd                             :  1; /**<bit[17 : 17] */
		uint32_t disp                             :  1; /**<bit[18 : 18] */
		uint32_t dmad                             :  1; /**<bit[19 : 19] */
		uint32_t h26f                             :  1; /**<bit[20 : 20] */
		uint32_t mac                              :  1; /**<bit[21 : 21] */
		uint32_t phy                              :  1; /**<bit[22 : 22] */
		uint32_t xvr                              :  1; /**<bit[23 : 23] */
		uint32_t irda                             :  1; /**<bit[24 : 24] */
		uint32_t la                               :  1; /**<bit[25 : 25] */
		uint32_t flsh                             :  1; /**<bit[26 : 26] */
		uint32_t uart                             :  1; /**<bit[27 : 27] */
		uint32_t spi0                             :  1; /**<bit[28 : 28] */
		uint32_t enc                              :  1; /**<bit[29 : 29] */
		uint32_t dma0                             :  1; /**<bit[30 : 30] */
		uint32_t dma1                             :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_device_mem_ctrl2_t;


typedef volatile union {
	struct {
		uint32_t pwd_mem1                         :  1; /**<bit[0 : 0] */
		uint32_t pwd_mem2                         :  1; /**<bit[1 : 1] */
		uint32_t pwd_mem3                         :  1; /**<bit[2 : 2] */
		uint32_t pwd_encp                         :  1; /**<bit[3 : 3] */
		uint32_t pwd_bakp                         :  1; /**<bit[4 : 4] */
		uint32_t pwd_ahbp                         :  1; /**<bit[5 : 5] */
		uint32_t pwd_audp                         :  1; /**<bit[6 : 6] */
		uint32_t pwd_vidp                         :  1; /**<bit[7 : 7] */
		uint32_t pwd_btsp                         :  1; /**<bit[8 : 8] */
		uint32_t pwd_wifp_mac                     :  1; /**<bit[9 : 9] */
		uint32_t pwd_wifp_phy                     :  1; /**<bit[10 : 10] */
		uint32_t pwd_mem0                         :  1; /**<bit[11 : 11] */
		uint32_t pwd_mem4                         :  1; /**<bit[12 : 12] */
		uint32_t pwd_ofdm                         :  1; /**<bit[13 : 13] */
		uint32_t tcm0_pgen                        :  1; /**<bit[14 : 14] */
		uint32_t rom_pgen                         :  1; /**<bit[15 : 15] */
		uint32_t sleep_en_need_flash_idle         :  1; /**<bit[16 : 16] */
		uint32_t sleep_en_need_cpu1_wfi           :  1; /**<bit[17 : 17] */
		uint32_t sleep_en_need_cpu0_wfi           :  1; /**<bit[18 : 18] */
		uint32_t sleep_en_global                  :  1; /**<bit[19 : 19] */
		uint32_t sleep_bus_idle_bypass            :  1; /**<bit[20 : 20] */
		uint32_t bts_wakeup_platform_en           :  1; /**<bit[21 : 21] */
		uint32_t bts_soft_wakeup_req              :  1; /**<bit[22 : 22] */
		uint32_t rom_rd_disable                   :  1; /**<bit[23 : 23] */
		uint32_t otp_rd_disable                   :  1; /**<bit[24 : 24] */
		uint32_t tcm1_pgen                        :  1; /**<bit[25 : 25] */
		uint32_t cpu0_subpwdm_en                  :  1; /**<bit[26 : 26] */
		uint32_t cpu1_subpwdm_en                  :  1; /**<bit[27 : 27] */
		uint32_t share_mem_clkgating_disable      :  1; /**<bit[28 : 28] */
		uint32_t cpu0_ticktimer_32k_enable        :  1; /**<bit[29 : 29] */
		uint32_t cpu1_ticktimer_32k_enable        :  1; /**<bit[30 : 30] */
		uint32_t reserved_bit_31_31               :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_power_sleep_wakeup_t;


typedef volatile union {
	struct {
		uint32_t reserved_0_31                    : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} sys_reserver_reg0x11_t;


typedef volatile union {
	struct {
		uint32_t ram0_mem_ds_deep_sleep           :  1; /**<bit[0 : 0] */
		uint32_t ram1_deep_sleep                  :  1; /**<bit[1 : 1] */
		uint32_t ram2_deep_sleep                  :  1; /**<bit[2 : 2] */
		uint32_t ram3_deep_sleep                  :  1; /**<bit[3 : 3] */
		uint32_t ram4_deep_sleep                  :  1; /**<bit[4 : 4] */
		uint32_t cpu0_icache_itag_deep_sleep      :  1; /**<bit[5 : 5] */
		uint32_t cpu0_dcache_dtag_deep_sleep      :  1; /**<bit[6 : 6] */
		uint32_t cpu1_icache_itag_deep_sleep      :  1; /**<bit[7 : 7] */
		uint32_t cpu1_dcache_dtag_deep_sleep      :  1; /**<bit[8 : 8] */
		uint32_t cpu0_itcm_deep_sleep             :  1; /**<bit[9 : 9] */
		uint32_t cpu0_dtcm_deep_sleep             :  1; /**<bit[10 : 10] */
		uint32_t cpu1_itcm_deep_sleep             :  1; /**<bit[11 : 11] */
		uint32_t cpu1_dtcm_deep_sleep             :  1; /**<bit[12 : 12] */
		uint32_t rott_deep_sleep                  :  1; /**<bit[13 : 13] */
		uint32_t reserved0                        :  1; /**<bit[14 : 14] */
		uint32_t reserved1                        :  1; /**<bit[15 : 15] */
		uint32_t ram0_mem_sd_shutdown             :  1; /**<bit[16 : 16] */
		uint32_t ram1_shutdown                    :  1; /**<bit[17 : 17] */
		uint32_t ram2_shutdown                    :  1; /**<bit[18 : 18] */
		uint32_t ram3_shutdown                    :  1; /**<bit[19 : 19] */
		uint32_t ram4_shutdown                    :  1; /**<bit[20 : 20] */
		uint32_t cpu0_icache_itag_shutdown        :  1; /**<bit[21 : 21] */
		uint32_t cpu0_dcache_dtag_shutdown        :  1; /**<bit[22 : 22] */
		uint32_t cpu1_icache_itag_shutdown        :  1; /**<bit[23 : 23] */
		uint32_t cpu1_dcache_dtag_shutdown        :  1; /**<bit[24 : 24] */
		uint32_t cpu0_itcm_shutdown               :  1; /**<bit[25 : 25] */
		uint32_t cpu0_dtcm_shutdown               :  1; /**<bit[26 : 26] */
		uint32_t cpu1_itcm_shutdown               :  1; /**<bit[27 : 27] */
		uint32_t cpu1_dtcm_shutdown               :  1; /**<bit[28 : 28] */
		uint32_t rott_shutdown                    :  1; /**<bit[29 : 29] */
		uint32_t reserved2                        :  1; /**<bit[30 : 30] */
		uint32_t reserved3                        :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu_device_mem_ctrl3_t;


typedef volatile union {
	struct {
		uint32_t cpu0_dma0_nsec_intr_en           :  1; /**<bit[0 : 0] */
		uint32_t cpu0_encp_sec_intr_en            :  1; /**<bit[1 : 1] */
		uint32_t cpu0_encp_nsec_intr_en           :  1; /**<bit[2 : 2] */
		uint32_t cpu0_timer0_int_en               :  1; /**<bit[3 : 3] */
		uint32_t cpu0_uart_int_en                 :  1; /**<bit[4 : 4] */
		uint32_t cpu0_pwm0_int_en                 :  1; /**<bit[5 : 5] */
		uint32_t cpu0_i2c0_int_en                 :  1; /**<bit[6 : 6] */
		uint32_t cpu0_spi0_int_en                 :  1; /**<bit[7 : 7] */
		uint32_t cpu0_sadc_int_en                 :  1; /**<bit[8 : 8] */
		uint32_t cpu0_irda_int_en                 :  1; /**<bit[9 : 9] */
		uint32_t cpu0_sdio_int_en                 :  1; /**<bit[10 : 10] */
		uint32_t cpu0_gdma_int_en                 :  1; /**<bit[11 : 11] */
		uint32_t cpu0_la_int_en                   :  1; /**<bit[12 : 12] */
		uint32_t cpu0_timer1_int_en               :  1; /**<bit[13 : 13] */
		uint32_t cpu0_i2c1_int_en                 :  1; /**<bit[14 : 14] */
		uint32_t cpu0_uart1_int_en                :  1; /**<bit[15 : 15] */
		uint32_t cpu0_uart2_int_en                :  1; /**<bit[16 : 16] */
		uint32_t cpu0_spi1_int_en                 :  1; /**<bit[17 : 17] */
		uint32_t cpu0_can_int_en                  :  1; /**<bit[18 : 18] */
		uint32_t cpu0_usb_int_en                  :  1; /**<bit[19 : 19] */
		uint32_t cpu0_qspi0_int_en                :  1; /**<bit[20 : 20] */
		uint32_t cpu0_fft_int_en                  :  1; /**<bit[21 : 21] */
		uint32_t cpu0_sbc_int_en                  :  1; /**<bit[22 : 22] */
		uint32_t cpu0_aud_int_en                  :  1; /**<bit[23 : 23] */
		uint32_t cpu0_i2s0_int_en                 :  1; /**<bit[24 : 24] */
		uint32_t cpu0_jpegenc_int_en              :  1; /**<bit[25 : 25] */
		uint32_t cpu0_jpegdec_int_en              :  1; /**<bit[26 : 26] */
		uint32_t cpu0_lcd_display_int_en          :  1; /**<bit[27 : 27] */
		uint32_t cpu0_dma2d_int_en                :  1; /**<bit[28 : 28] */
		uint32_t cpu0_wifi_int_phy_mpb_en         :  1; /**<bit[29 : 29] */
		uint32_t cpu0_wifi_int_phy_riu_en         :  1; /**<bit[30 : 30] */
		uint32_t cpu0_wifi_mac_int_tx_rx_timer_en :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu0_int_0_31_en_t;


typedef volatile union {
	struct {
		uint32_t cpu0_wifi_mac_int_tx_rx_misc_en  :  1; /**<bit[0 : 0] */
		uint32_t cpu0_wifi_mac_int_rx_trigger_en  :  1; /**<bit[1 : 1] */
		uint32_t cpu0_wifi_mac_int_tx_trigger_en  :  1; /**<bit[2 : 2] */
		uint32_t cpu0_wifi_mac_int_prot_trigger_en :  1; /**<bit[3 : 3] */
		uint32_t cpu0_wifi_mac_int_gen_en         :  1; /**<bit[4 : 4] */
		uint32_t cpu0_wifi_hsu_irq_en             :  1; /**<bit[5 : 5] */
		uint32_t cpu0_wifi_int_mac_wakeup_en      :  1; /**<bit[6 : 6] */
		uint32_t cpu0_dm_irq_en                   :  1; /**<bit[7 : 7] */
		uint32_t cpu0_ble_irq_en                  :  1; /**<bit[8 : 8] */
		uint32_t cpu0_bt_irq_en                   :  1; /**<bit[9 : 9] */
		uint32_t cpu0_qspi1_int_en                :  1; /**<bit[10 : 10] */
		uint32_t cpu0_pwm1_int_en                 :  1; /**<bit[11 : 11] */
		uint32_t cpu0_i2s1_int_en                 :  1; /**<bit[12 : 12] */
		uint32_t cpu0_i2s2_int_en                 :  1; /**<bit[13 : 13] */
		uint32_t cpu0_h264_int_en                 :  1; /**<bit[14 : 14] */
		uint32_t cpu0_sdmadc_int_en               :  1; /**<bit[15 : 15] */
		uint32_t cpu0_mbox0_int_en                :  1; /**<bit[16 : 16] */
		uint32_t cpu0_mbox1_int_en                :  1; /**<bit[17 : 17] */
		uint32_t cpu0_bmc64_int_en                :  1; /**<bit[18 : 18] */
		uint32_t cpu0_dpll_unlock_int_en          :  1; /**<bit[19 : 19] */
		uint32_t cpu0_touched_int_en              :  1; /**<bit[20 : 20] */
		uint32_t cpu0_usbplug_int_en              :  1; /**<bit[21 : 21] */
		uint32_t cpu0_rtc_int_en                  :  1; /**<bit[22 : 22] */
		uint32_t cpu0_gpio_int_en                 :  1; /**<bit[23 : 23] */
		uint32_t cpu0_dma1_sec_int_en             :  1; /**<bit[24 : 24] */
		uint32_t cpu0_dma1_nsec_int_en            :  1; /**<bit[25 : 25] */
		uint32_t cpu0_yuvb_int_en                 :  1; /**<bit[26 : 26] */
		uint32_t cpu0_rott_int_en                 :  1; /**<bit[27 : 27] */
		uint32_t reserved0                        :  4; /**<bit[28 : 31] */
	};
	uint32_t v;
} sys_cpu0_int_32_63_en_t;


typedef volatile union {
	struct {
		uint32_t cpu1_dma0_nsec_intr_en           :  1; /**<bit[0 : 0] */
		uint32_t cpu1_encp_sec_intr_en            :  1; /**<bit[1 : 1] */
		uint32_t cpu1_encp_nsec_intr_en           :  1; /**<bit[2 : 2] */
		uint32_t cpu1_timer0_int_en               :  1; /**<bit[3 : 3] */
		uint32_t cpu1_uart_int_en                 :  1; /**<bit[4 : 4] */
		uint32_t cpu1_pwm0_int_en                 :  1; /**<bit[5 : 5] */
		uint32_t cpu1_i2c0_int_en                 :  1; /**<bit[6 : 6] */
		uint32_t cpu1_spi0_int_en                 :  1; /**<bit[7 : 7] */
		uint32_t cpu1_sadc_int_en                 :  1; /**<bit[8 : 8] */
		uint32_t cpu1_irda_int_en                 :  1; /**<bit[9 : 9] */
		uint32_t cpu1_sdio_int_en                 :  1; /**<bit[10 : 10] */
		uint32_t cpu1_gdma_int_en                 :  1; /**<bit[11 : 11] */
		uint32_t cpu1_la_int_en                   :  1; /**<bit[12 : 12] */
		uint32_t cpu1_timer1_int_en               :  1; /**<bit[13 : 13] */
		uint32_t cpu1_i2c1_int_en                 :  1; /**<bit[14 : 14] */
		uint32_t cpu1_uart1_int_en                :  1; /**<bit[15 : 15] */
		uint32_t cpu1_uart2_int_en                :  1; /**<bit[16 : 16] */
		uint32_t cpu1_spi1_int_en                 :  1; /**<bit[17 : 17] */
		uint32_t cpu1_can_int_en                  :  1; /**<bit[18 : 18] */
		uint32_t cpu1_usb_int_en                  :  1; /**<bit[19 : 19] */
		uint32_t cpu1_qspi0_int_en                :  1; /**<bit[20 : 20] */
		uint32_t cpu1_fft_int_en                  :  1; /**<bit[21 : 21] */
		uint32_t cpu1_sbc_int_en                  :  1; /**<bit[22 : 22] */
		uint32_t cpu1_aud_int_en                  :  1; /**<bit[23 : 23] */
		uint32_t cpu1_i2s0_int_en                 :  1; /**<bit[24 : 24] */
		uint32_t cpu1_jpegenc_int_en              :  1; /**<bit[25 : 25] */
		uint32_t cpu1_jpegdec_int_en              :  1; /**<bit[26 : 26] */
		uint32_t cpu1_lcd_display_int_en          :  1; /**<bit[27 : 27] */
		uint32_t cpu1_dma2d_int_en                :  1; /**<bit[28 : 28] */
		uint32_t cpu1_wifi_int_phy_mpb_en         :  1; /**<bit[29 : 29] */
		uint32_t cpu1_wifi_int_phy_riu_en         :  1; /**<bit[30 : 30] */
		uint32_t cpu1_wifi_mac_int_tx_rx_timer_en :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu1_int_0_31_en_t;


typedef volatile union {
	struct {
		uint32_t cpu1_wifi_mac_int_tx_rx_misc_en  :  1; /**<bit[0 : 0] */
		uint32_t cpu1_wifi_mac_int_rx_trigger_en  :  1; /**<bit[1 : 1] */
		uint32_t cpu1_wifi_mac_int_tx_trigger_en  :  1; /**<bit[2 : 2] */
		uint32_t cpu1_wifi_mac_int_prot_trigger_en :  1; /**<bit[3 : 3] */
		uint32_t cpu1_wifi_mac_int_gen_en         :  1; /**<bit[4 : 4] */
		uint32_t cpu1_wifi_hsu_irq_en             :  1; /**<bit[5 : 5] */
		uint32_t cpu1_wifi_int_mac_wakeup_en      :  1; /**<bit[6 : 6] */
		uint32_t cpu1_dm_irq_en                   :  1; /**<bit[7 : 7] */
		uint32_t cpu1_ble_irq_en                  :  1; /**<bit[8 : 8] */
		uint32_t cpu1_bt_irq_en                   :  1; /**<bit[9 : 9] */
		uint32_t cpu1_qspi1_int_en                :  1; /**<bit[10 : 10] */
		uint32_t cpu1_pwm1_int_en                 :  1; /**<bit[11 : 11] */
		uint32_t cpu1_i2s1_int_en                 :  1; /**<bit[12 : 12] */
		uint32_t cpu1_i2s2_int_en                 :  1; /**<bit[13 : 13] */
		uint32_t cpu1_h264_int_en                 :  1; /**<bit[14 : 14] */
		uint32_t cpu1_sdmadc_int_en               :  1; /**<bit[15 : 15] */
		uint32_t cpu1_mbox0_int_en                :  1; /**<bit[16 : 16] */
		uint32_t cpu1_mbox1_int_en                :  1; /**<bit[17 : 17] */
		uint32_t cpu1_bmc64_int_en                :  1; /**<bit[18 : 18] */
		uint32_t cpu1_dpll_unlock_int_en          :  1; /**<bit[19 : 19] */
		uint32_t cpu1_touched_int_en              :  1; /**<bit[20 : 20] */
		uint32_t cpu1_usbplug_int_en              :  1; /**<bit[21 : 21] */
		uint32_t cpu1_rtc_int_en                  :  1; /**<bit[22 : 22] */
		uint32_t cpu1_gpio_int_en                 :  1; /**<bit[23 : 23] */
		uint32_t cpu1_dma1_sec_int_en             :  1; /**<bit[24 : 24] */
		uint32_t cpu1_dma1_nsec_int_en            :  1; /**<bit[25 : 25] */
		uint32_t cpu1_yuvb_int_en                 :  1; /**<bit[26 : 26] */
		uint32_t cpu1_rott_int_en                 :  1; /**<bit[27 : 27] */
		uint32_t reserved0                        :  4; /**<bit[28 : 31] */
	};
	uint32_t v;
} sys_cpu1_int_32_63_en_t;


typedef volatile union {
	struct {
		uint32_t cpu0_dma0_nsec_intr_st           :  1; /**<bit[0 : 0] */
		uint32_t cpu0_encp_sec_intr_st            :  1; /**<bit[1 : 1] */
		uint32_t cpu0_encp_nsec_intr_st           :  1; /**<bit[2 : 2] */
		uint32_t cpu0_timer0_int_st               :  1; /**<bit[3 : 3] */
		uint32_t cpu0_uart_int_st                 :  1; /**<bit[4 : 4] */
		uint32_t cpu0_pwm0_int_st                 :  1; /**<bit[5 : 5] */
		uint32_t cpu0_i2c0_int_st                 :  1; /**<bit[6 : 6] */
		uint32_t cpu0_spi0_int_st                 :  1; /**<bit[7 : 7] */
		uint32_t cpu0_sadc_int_st                 :  1; /**<bit[8 : 8] */
		uint32_t cpu0_irda_int_st                 :  1; /**<bit[9 : 9] */
		uint32_t cpu0_sdio_int_st                 :  1; /**<bit[10 : 10] */
		uint32_t cpu0_gdma_int_st                 :  1; /**<bit[11 : 11] */
		uint32_t cpu0_la_int_st                   :  1; /**<bit[12 : 12] */
		uint32_t cpu0_timer1_int_st               :  1; /**<bit[13 : 13] */
		uint32_t cpu0_i2c1_int_st                 :  1; /**<bit[14 : 14] */
		uint32_t cpu0_uart1_int_st                :  1; /**<bit[15 : 15] */
		uint32_t cpu0_uart2_int_st                :  1; /**<bit[16 : 16] */
		uint32_t cpu0_spi1_int_st                 :  1; /**<bit[17 : 17] */
		uint32_t cpu0_can_int_st                  :  1; /**<bit[18 : 18] */
		uint32_t cpu0_usb_int_st                  :  1; /**<bit[19 : 19] */
		uint32_t cpu0_qspi0_int_st                :  1; /**<bit[20 : 20] */
		uint32_t cpu0_fft_int_st                  :  1; /**<bit[21 : 21] */
		uint32_t cpu0_sbc_int_st                  :  1; /**<bit[22 : 22] */
		uint32_t cpu0_aud_int_st                  :  1; /**<bit[23 : 23] */
		uint32_t cpu0_i2s0_int_st                 :  1; /**<bit[24 : 24] */
		uint32_t cpu0_jpegenc_int_st              :  1; /**<bit[25 : 25] */
		uint32_t cpu0_jpegdec_int_st              :  1; /**<bit[26 : 26] */
		uint32_t cpu0_lcd_display_int_st          :  1; /**<bit[27 : 27] */
		uint32_t cpu0_dma2d_int_st                :  1; /**<bit[28 : 28] */
		uint32_t cpu0_wifi_int_phy_mpb_st         :  1; /**<bit[29 : 29] */
		uint32_t cpu0_wifi_int_phy_riu_st         :  1; /**<bit[30 : 30] */
		uint32_t cpu0_wifi_mac_int_tx_rx_timer_st :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_cpu0_int_0_31_status_t;


typedef volatile union {
	struct {
		uint32_t cpu0_wifi_mac_int_tx_rx_misc_st  :  1; /**<bit[0 : 0] */
		uint32_t cpu0_wifi_mac_int_rx_trigger_st  :  1; /**<bit[1 : 1] */
		uint32_t cpu0_wifi_mac_int_tx_trigger_st  :  1; /**<bit[2 : 2] */
		uint32_t cpu0_wifi_mac_int_prot_trigger_st :  1; /**<bit[3 : 3] */
		uint32_t cpu0_wifi_mac_int_gen_st         :  1; /**<bit[4 : 4] */
		uint32_t cpu0_wifi_hsu_irq_st             :  1; /**<bit[5 : 5] */
		uint32_t cpu0_wifi_int_mac_wakeup_st      :  1; /**<bit[6 : 6] */
		uint32_t cpu0_dm_irq_st                   :  1; /**<bit[7 : 7] */
		uint32_t cpu0_ble_irq_st                  :  1; /**<bit[8 : 8] */
		uint32_t cpu0_bt_irq_st                   :  1; /**<bit[9 : 9] */
		uint32_t cpu0_qspi1_int_st                :  1; /**<bit[10 : 10] */
		uint32_t cpu0_pwm1_int_st                 :  1; /**<bit[11 : 11] */
		uint32_t cpu0_i2s1_int_st                 :  1; /**<bit[12 : 12] */
		uint32_t cpu0_i2s2_int_st                 :  1; /**<bit[13 : 13] */
		uint32_t cpu0_h264_int_st                 :  1; /**<bit[14 : 14] */
		uint32_t cpu0_sdmadc_int_st               :  1; /**<bit[15 : 15] */
		uint32_t cpu0_mbox0_int_st                :  1; /**<bit[16 : 16] */
		uint32_t cpu0_mbox1_int_st                :  1; /**<bit[17 : 17] */
		uint32_t cpu0_bmc64_int_st                :  1; /**<bit[18 : 18] */
		uint32_t cpu0_dpll_unlock_int_st          :  1; /**<bit[19 : 19] */
		uint32_t cpu0_touched_int_st              :  1; /**<bit[20 : 20] */
		uint32_t cpu0_usbplug_int_st              :  1; /**<bit[21 : 21] */
		uint32_t cpu0_rtc_int_st                  :  1; /**<bit[22 : 22] */
		uint32_t cpu0_gpio_int_st                 :  1; /**<bit[23 : 23] */
		uint32_t cpu0_dma1_sec_int_st             :  1; /**<bit[24 : 24] */
		uint32_t cpu0_dma1_nsec_int_st            :  1; /**<bit[25 : 25] */
		uint32_t cpu0_yuvb_int_st                 :  1; /**<bit[26 : 26] */
		uint32_t cpu0_rott_int_st                 :  1; /**<bit[27 : 27] */
		uint32_t reserved0                        :  4; /**<bit[28 : 31] */
	};
	uint32_t v;
} sys_cpu0_int_32_63_status_t;


