bekencorp/bk_idk/middleware/soc/bk7286/soc/sys_struct.h
typedef volatile union {
	struct {
		uint32_t iselaud                          :  1; /**<bit[0 : 0] */
		uint32_t audck_rlcen1v                    :  1; /**<bit[1 : 1] */
		uint32_t lchckinven1v                     :  1; /**<bit[2 : 2] */
		uint32_t enaudbias                        :  1; /**<bit[3 : 3] */
		uint32_t enadcbias                        :  1; /**<bit[4 : 4] */
		uint32_t enmicbias                        :  1; /**<bit[5 : 5] */
		uint32_t adcckinven1v                     :  1; /**<bit[6 : 6] */
		uint32_t dacfb2st0v9                      :  1; /**<bit[7 : 7] */
		uint32_t nc_8_8                           :  1; /**<bit[8 : 8] */
		uint32_t micbias_trm                      :  2; /**<bit[9 : 10] */
		uint32_t micbias_voc                      :  5; /**<bit[11 : 15] */
		uint32_t vrefsel1v                        :  1; /**<bit[16 : 16] */
		uint32_t capswspi                         :  5; /**<bit[17 : 21] */
		uint32_t adref_sel                        :  2; /**<bit[22 : 23] */
		uint32_t nc_24_25                         :  2; /**<bit[24 : 25] */
		uint32_t reserved_bit_26_30               :  5; /**<bit[26 : 30] */
		uint32_t spi_dacckpssel                   :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg18_t;


typedef volatile union {
	struct {
		uint32_t isel                             :  2; /**<bit[0 : 1] */
		uint32_t micirsel1                        :  1; /**<bit[2 : 2] */
		uint32_t micdacit                         :  2; /**<bit[3 : 4] */
		uint32_t micdacih                         :  8; /**<bit[5 : 12] */
		uint32_t micsingleen                      :  1; /**<bit[13 : 13] */
		uint32_t dccompen                         :  1; /**<bit[14 : 14] */
		uint32_t micgain                          :  4; /**<bit[15 : 18] */
		uint32_t micdacen                         :  1; /**<bit[19 : 19] */
		uint32_t stg2lsen1v                       :  1; /**<bit[20 : 20] */
		uint32_t openloopcal1v                    :  1; /**<bit[21 : 21] */
		uint32_t callatch                         :  1; /**<bit[22 : 22] */
		uint32_t vcmsel                           :  1; /**<bit[23 : 23] */
		uint32_t dwamode                          :  1; /**<bit[24 : 24] */
		uint32_t r2ren                            :  1; /**<bit[25 : 25] */
		uint32_t nc_26_27                         :  2; /**<bit[26 : 27] */
		uint32_t micen                            :  1; /**<bit[28 : 28] */
		uint32_t rst                              :  1; /**<bit[29 : 29] */
		uint32_t bpdwa1v                          :  1; /**<bit[30 : 30] */
		uint32_t hcen1stg                         :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} sys_ana_reg19_t;


typedef volatile union {
	struct {
		uint32_t hpdac                            :  1; /**<bit[0 : 0] */
		uint32_t calcon_sel                       :  1; /**<bit[1 : 1] */
		uint32_t oscdac                           :  2; /**<bit[2 : 3] */
		uint32_t ocendac                          :  1; /**<bit[4 : 4] */
		uint32_t vcmsel                           :  1; /**<bit[5 : 5] */
		uint32_t adjdacref                        :  5; /**<bit[6 : 10] */
		uint32_t dcochg                           :  2; /**<bit[11 : 12] */
		uint32_t diffen                           :  1; /**<bit[13 : 13] */
		uint32_t endaccal                         :  1; /**<bit[14 : 14] */
		uint32_t nc_15_15                         :  1; /**<bit[15 : 15] */
		uint32_t lendcoc                          :  1; /**<bit[16 : 16] */
		uint32_t nc_17_17                         :  1; /**<bit[17 : 17] */
		uint32_t lenvcmd                          :  1; /**<bit[18 : 18] */
		uint32_t dacdrven                         :  1; /**<bit[19 : 19] */
		uint32_t nc_20_20                         :  1; /**<bit[20 : 20] */
		uint32_t daclen                           :  1; /**<bit[21 : 21] */
		uint32_t dacg                             :  4; /**<bit[22 : 25] */
		uint32_t dacmute                          :  1; /**<bit[26 : 26] */
		uint32_t dacdwamode_sel                   :  1; /**<bit[27 : 27] */
		uint32_t dacsel                           :  4; /**<bit[28 : 31] */
	};
	uint32_t v;
} sys_ana_reg20_t;


typedef volatile union {
	struct {
		uint32_t lmdcin                           :  8; /**<bit[0 : 7] */
		uint32_t nc_8_15                          :  8; /**<bit[8 : 15] */
		uint32_t spirst_ovc                       :  1; /**<bit[16 : 16] */
		uint32_t nc_17_17                         :  1; /**<bit[17 : 17] */
		uint32_t enidacl                          :  1; /**<bit[18 : 18] */
		uint32_t dac3rdhc0v9                      :  1; /**<bit[19 : 19] */
		uint32_t hc2s                             :  1; /**<bit[20 : 20] */
		uint32_t rfb_ctrl                         :  1; /**<bit[21 : 21] */
		uint32_t vcmsel                           :  1; /**<bit[22 : 22] */
		uint32_t enbs                             :  1; /**<bit[23 : 23] */
		uint32_t calck_sel0v9                     :  1; /**<bit[24 : 24] */
		uint32_t bpdwa0v9                         :  1; /**<bit[25 : 25] */
		uint32_t looprst0v9                       :  1; /**<bit[26 : 26] */
		uint32_t oct0v9                           :  2; /**<bit[27 : 28] */
		uint32_t sout0v9                          :  1; /**<bit[29 : 29] */
		uint32_t hc0v9                            :  2; /**<bit[30 : 31] */
	};
	uint32_t v;
} sys_ana_reg21_t;

typedef volatile struct {
	volatile sys_device_id_t device_id;
	volatile sys_version_id_t version_id;
	volatile sys_cpu_storage_connect_op_select_t cpu_storage_connect_op_select;
	volatile sys_cpu_current_run_status_t cpu_current_run_status;
	volatile sys_cpu0_int_halt_clk_op_t cpu0_int_halt_clk_op;
	volatile sys_cpu1_int_halt_clk_op_t cpu1_int_halt_clk_op;
	volatile sys_reserved_reg0x6_t reserved_reg0x6;
	volatile uint32_t rsv_7_7[1];
	volatile sys_cpu_clk_div_mode1_t cpu_clk_div_mode1;
	volatile sys_cpu_clk_div_mode2_t cpu_clk_div_mode2;
	volatile sys_cpu_26m_wdt_clk_div_t cpu_26m_wdt_clk_div;
	volatile sys_cpu_anaspi_freq_t cpu_anaspi_freq;
	volatile sys_cpu_device_clk_enable_t cpu_device_clk_enable;
	volatile sys_reserver_reg0xd_t reserver_reg0xd;
	volatile sys_cpu_device_mem_ctrl1_t cpu_device_mem_ctrl1;
	volatile sys_cpu_device_mem_ctrl2_t cpu_device_mem_ctrl2;
	volatile sys_cpu_power_sleep_wakeup_t cpu_power_sleep_wakeup;
	volatile sys_reserver_reg0x11_t reserver_reg0x11;
	volatile sys_cpu_device_mem_ctrl3_t cpu_device_mem_ctrl3;
	volatile uint32_t rsv_13_1f[13];
	volatile sys_cpu0_int_0_31_en_t cpu0_int_0_31_en;
	volatile sys_cpu0_int_32_63_en_t cpu0_int_32_63_en;
	volatile sys_cpu1_int_0_31_en_t cpu1_int_0_31_en;
	volatile sys_cpu1_int_32_63_en_t cpu1_int_32_63_en;
	volatile uint32_t rsv_24_27[4];
	volatile sys_cpu0_int_0_31_status_t cpu0_int_0_31_status;
	volatile sys_cpu0_int_32_63_status_t cpu0_int_32_63_status;
	volatile sys_cpu1_int_0_31_status_t cpu1_int_0_31_status;
	volatile sys_cpu1_int_32_63_status_t cpu1_int_32_63_status;
	volatile uint32_t rsv_2c_2f[4];
	volatile sys_gpio_config0_t gpio_config0;
	volatile sys_gpio_config1_t gpio_config1;
	volatile sys_gpio_config2_t gpio_config2;
	volatile sys_gpio_config3_t gpio_config3;
	volatile sys_gpio_config4_t gpio_config4;
	volatile sys_gpio_config5_t gpio_config5;
	volatile uint32_t rsv_36_37[2];
	volatile sys_sys_debug_config0_t sys_debug_config0;
	volatile sys_sys_debug_config1_t sys_debug_config1;
	volatile uint32_t rsv_3a_3f[6];
	volatile sys_ana_reg0_t ana_reg0;
	volatile sys_ana_reg1_t ana_reg1;
	volatile sys_ana_reg2_t ana_reg2;
	volatile sys_ana_reg3_t ana_reg3;
	volatile sys_ana_reg4_t ana_reg4;
	volatile sys_ana_reg5_t ana_reg5;
	volatile sys_ana_reg6_t ana_reg6;
	volatile sys_ana_reg7_t ana_reg7;
	volatile sys_ana_reg8_t ana_reg8;
	volatile sys_ana_reg9_t ana_reg9;
	volatile sys_ana_reg10_t ana_reg10;
	volatile sys_ana_reg11_t ana_reg11;
	volatile sys_ana_reg12_t ana_reg12;
	volatile sys_ana_reg13_t ana_reg13;
	volatile sys_ana_reg14_t ana_reg14;
	volatile sys_ana_reg15_t ana_reg15;
	volatile sys_ana_reg16_t ana_reg16;
	volatile sys_ana_reg17_t ana_reg17;
	volatile sys_ana_reg18_t ana_reg18;
	volatile sys_ana_reg19_t ana_reg19;
	volatile sys_ana_reg20_t ana_reg20;
	volatile sys_ana_reg21_t ana_reg21;
} sys_hw_t;

#ifdef __cplusplus
}
#endif
